000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДанныеКредитныхПрограмм/ДанныеКредитныхПрограмм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеКредитныхПрограмм</name>
  <resources>
    <name>УслугаБанка</name>
    <type>
      <types>CatalogRef.УслугиБанка</types>
    </type>
  </resources>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Интеграция</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <comment>УИ без символов &quot;-&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </resources>
  <resources>
    <name>УслугаБанкаПериодПредоставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКредитаВозврат</name>
    <comment>Сумма, опредённая при возврате товаров от покупателя</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГарантийноеПисьмоДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийноеПисьмоПодтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаОформлениеКредита</types>
    </type>
  </resources>
  <resources>
    <name>ОтветБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеВозвратов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторБанкаВозврата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВозврата</name>
    <comment>УИ без символов &quot;-&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтветБанкаВозврат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВозврата</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаОформлениеКредита</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СчетНаОплатуПокупателю</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗаявкиНаОформлениеКредита/СтатусыЗаявкиНаОформлениеКредита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявкиНаОформлениеКредита</name>
  <enumValues>
    <name>ОжидаетсяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПодтверждениеПокупателя</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>ОтменаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ОтменаСогласована</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>СогласованоБанком</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаОтмену</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВозврата</name>
  </enumValues>
  <enumValues>
    <name>РассматриваетсяВозврат</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСогласован</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ОбменСБанкамиСобытия/Module.bsl
#Область ПоддержкаРегламентногоОбслуживания

Процедура РегламентКредитныхПрограмм() Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаРегистра.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю,
		|	ТаблицаРегистра.УслугаБанка КАК КредитнаяПрограмма
		|ИЗ
		|	РегистрСведений.ДанныеКредитныхПрограмм КАК ТаблицаРегистра
		|ГДЕ
		|	(НЕ ТаблицаРегистра.Отгружено
		|			ИЛИ ТаблицаРегистра.Отменить
		|				И НЕ ТаблицаРегистра.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявкиНаОформлениеКредита.ОтменаСогласована))
		|	И НЕ ТаблицаРегистра.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявкиНаОформлениеКредита.Отклонено)
		|	И НЕ ТаблицаРегистра.ИдентификаторБанка = """"
		|	И ТаблицаРегистра.СчетНаОплатуПокупателю.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ, -1)"
		);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда

			Выборка = Результат.Выбрать();

			Пока Выборка.Следующий() Цикл
		
				ДанныеПрограммы = ОбменСБанкамиПовтИсп.ПолучитьДанныеПрограммы(Выборка.КредитнаяПрограмма);

				Если ДанныеПрограммы.Найден Тогда

					ТекстСообщения = "";
					ОбменСБанкамиСервер.ПроверитьСостояниеЗаявкиНаОформлениеКредита(Выборка.СчетНаОплатуПокупателю, Выборка.КредитнаяПрограмма, ТекстСообщения);

				Иначе

					ОбменСБанкамиСервер.УстановитьКомментарий(
						"Не обнаружены данные кредитной программы «" + Выборка.КредитнаяПрограмма + "»"
						, Выборка.СчетНаОплатуПокупателю
						, Выборка.КредитнаяПрограмма
					);

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
